const protocol = `
1. 接受用户协议

欢迎使用我们的小程序（以下简称“本产品”）。在访问或使用本产品之前，请仔细阅读并理解本用户协议（以下简称“本协议”）。通过访问或使用本产品，您表示已阅读、理解并同意遵守本协议的所有条款。如果您不同意本协议的任何部分，请停止访问和使用本产品。

2. 使用账户

2.1 您需要注册一个账户才能访问本产品的某些功能。在注册时，您必须提供准确、完整和最新的个人信息，并确保随时更新这些信息以保持其准确性。

2.2 您的账户信息（包括用户名和密码）是您的责任，您应对其保密，不得与他人共享。您对您的账户活动承担全部责任。如有未经授权的使用或任何安全漏洞，请立即通知我们。

3. 费用

您必须自行负担购买本产品的费用，个人上网或第三方（包括但不限于电信或移动通讯提供商）收取的通讯费、信息费等相关费用。如涉及电信增值服务，我们建议您与增值服务提供商确认相关费用问题。

4. 遵守法律

您同意遵守中华人民共和国的法律法规，包括但不限于《合同法》、《著作权法》、《人大安全决定》、《保守国家秘密法》、《电信条例》、《计算机信息系统安全保护条例》等。您对以任何方式使用您的密码和您的账号使用本服务的任何行为及其结果承担全部责任。

5. 用户内容

5.1 用户内容是指您在使用本产品时产生的所有内容，包括您的信息、图片、音乐或其他内容。

5.2 您是您的用户内容的唯一责任人，您将承担因您的用户内容披露而导致的风险。

5.3 您已同意您的用户内容受到权利限制。

6. 权利限制

您已同意通过分享或其他方式使用本产品中的相关服务时，不得进行以下行为：

破坏宪法所确定的基本原则；
危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一；
损害国家荣誉和利益；
煽动民族仇恨、民族歧视，破坏民族团结；
破坏国家宗教政策，宣扬邪教和封建迷信；
散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪；
侮辱或者诽谤他人，侵害他人合法权益；
含有法律、行政法规禁止的其他内容。
7. 修改和终止

7.1 修改：本协议容许变更。如果本协议有任何实质性变更，我们将通过版本更新来通知您。继续使用本产品则表示您已知晓此类变更并同意条款约束。

7.2 终止：我们保留在任何时候无需通知而修改、保留或关闭本产品任何服务之权利。您已同意我们无需因此承担法律责任。一旦本协议终止，您的使用权将终止，您的用户内容将从我们的活动数据库中删除。

8. 第三方

您已知晓本产品可能基于第三方技术支持获得。本协议是您与我们之间的协议，不涉及您与第三方之间的关系。您已同意遵守且授权给本产品限制您有条件地使用服务。

9. 赔偿

您已同意无害地使用本产品，避免因您的行为或用户内容而导致的投诉、诉讼、损失、损害、责任、成本和费用。我们保留请求赔偿的权利。

10. 适用法律

本协议适用中华人民共和国法律。如发生纠纷，应协商解决，如果协商不成，应向所在地的法院提起诉讼。

11. 独立性

如果本协议的某些条款无法适用，不会影响其他条款的有效性。

12. 完整性

本协议是您和本产品之间关于本产品相关事项的最终的、完整的、排他的协议，取代和合并之前的讨论和协议。
`

Page({
    data: {
        protocol: protocol,
    },
})